Tekla.Structures.Catalogs.ProfileItemParameter.ParameterUnitTypeEnum
Defines the different unit types of the profile item parameter.

Tekla.Structures.Catalogs.ProfileItemParameter.ParameterUnitTypeEnum.INPUT_BOOLEAN
The input boolean.

Tekla.Structures.Catalogs.ProfileItemParameter.ParameterUnitTypeEnum.INPUT_INTEGER
The input integer.

Tekla.Structures.Catalogs.ProfileItemParameter.ParameterUnitTypeEnum.INPUT_STRING
The input string.

Tekla.Structures.Catalogs.ProfileItemParameter.ParameterUnitTypeEnum.INPUT_NONE
The input none.

Tekla.Structures.Catalogs.ProfileItemParameter.ParameterUnitTypeEnum.INPUT_RATIO_UNIT
The input ratio unit.

Tekla.Structures.Catalogs.ProfileItemParameter.ParameterUnitTypeEnum.INPUT_STRAIN_UNIT
The input strain unit.

Tekla.Structures.Catalogs.ProfileItemParameter.ParameterUnitTypeEnum.INPUT_ANGLE_UNIT
The input angle unit.

Tekla.Structures.Catalogs.ProfileItemParameter.ParameterUnitTypeEnum.OUTPUT_ANGLE_UNIT
The output angle unit.

Tekla.Structures.Catalogs.ProfileItemParameter.ParameterUnitTypeEnum.INPUT_SECTION_ANGLE_UNIT
The input section angle unit.

Tekla.Structures.Catalogs.ProfileItemParameter.ParameterUnitTypeEnum.INPUT_LENGTH_UNIT
The input length unit.

Tekla.Structures.Catalogs.ProfileItemParameter.ParameterUnitTypeEnum.OUTPUT_LENGTH_UNIT
The output length unit.

Tekla.Structures.Catalogs.ProfileItemParameter.ParameterUnitTypeEnum.INPUT_DEFORMATION_UNIT
The input deformation unit.

Tekla.Structures.Catalogs.ProfileItemParameter.ParameterUnitTypeEnum.OUTPUT_DEFORMATION_UNIT
The output deformation unit.

Tekla.Structures.Catalogs.ProfileItemParameter.ParameterUnitTypeEnum.INPUT_DIMENSION_UNIT
The input dimension unit.

Tekla.Structures.Catalogs.ProfileItemParameter.ParameterUnitTypeEnum.INPUT_RADIUSOFINERTIA_UNIT
The input radius of inertia unit.

Tekla.Structures.Catalogs.ProfileItemParameter.ParameterUnitTypeEnum.INPUT_AREA_UNIT
The input area unit.

Tekla.Structures.Catalogs.ProfileItemParameter.ParameterUnitTypeEnum.OUTPUT_REINFAREA_UNIT
The output reinforced area unit.

Tekla.Structures.Catalogs.ProfileItemParameter.ParameterUnitTypeEnum.OUTPUT_TRANSVREINF_UNIT
The output transverse reinforcement unit.

Tekla.Structures.Catalogs.ProfileItemParameter.ParameterUnitTypeEnum.INPUT_AREAPERLENGTH_UNIT
The input area per length unit.

Tekla.Structures.Catalogs.ProfileItemParameter.ParameterUnitTypeEnum.OUTPUT_VOLUME_UNIT
The output volume unit.

Tekla.Structures.Catalogs.ProfileItemParameter.ParameterUnitTypeEnum.INPUT_SECTIONMODULUS_UNIT
The input section modulus unit.

Tekla.Structures.Catalogs.ProfileItemParameter.ParameterUnitTypeEnum.INPUT_VOLUME_UNIT
The input volume unit.

Tekla.Structures.Catalogs.ProfileItemParameter.ParameterUnitTypeEnum.INPUT_MOMENTOFINERTIA_UNIT
The input moment of inertia unit.

Tekla.Structures.Catalogs.ProfileItemParameter.ParameterUnitTypeEnum.INPUT_TORSIONCONSTANT_UNIT
The input torsion constant unit.

Tekla.Structures.Catalogs.ProfileItemParameter.ParameterUnitTypeEnum.INPUT_WARPINGCONSTANT_UNIT
The input warping constant unit.

Tekla.Structures.Catalogs.ProfileItemParameter.ParameterUnitTypeEnum.INPUT_FORCE_UNIT
The input force unit.

Tekla.Structures.Catalogs.ProfileItemParameter.ParameterUnitTypeEnum.OUTPUT_FORCE_UNIT
The output force unit.

Tekla.Structures.Catalogs.ProfileItemParameter.ParameterUnitTypeEnum.INPUT_WEIGHT_UNIT
The input weight unit.

Tekla.Structures.Catalogs.ProfileItemParameter.ParameterUnitTypeEnum.OUTPUT_WEIGHT_UNIT
The output weight unit.

Tekla.Structures.Catalogs.ProfileItemParameter.ParameterUnitTypeEnum.INPUT_DISTRIBLOAD_UNIT
The input distributed load unit.

Tekla.Structures.Catalogs.ProfileItemParameter.ParameterUnitTypeEnum.OUTPUT_DISTRIBLOAD_UNIT
The output distributed load unit.

Tekla.Structures.Catalogs.ProfileItemParameter.ParameterUnitTypeEnum.INPUT_SPRINGCONSTANT_UNIT
The input spring constant unit.

Tekla.Structures.Catalogs.ProfileItemParameter.ParameterUnitTypeEnum.OUTPUT_MASSPERLENGTH_UNIT
The output mass per length unit.

Tekla.Structures.Catalogs.ProfileItemParameter.ParameterUnitTypeEnum.INPUT_SURFACELOAD_UNIT
The input surface load unit.

Tekla.Structures.Catalogs.ProfileItemParameter.ParameterUnitTypeEnum.OUTPUT_SURFACELOAD_UNIT
The output surface load unit.

Tekla.Structures.Catalogs.ProfileItemParameter.ParameterUnitTypeEnum.INPUT_STRENGTH_UNIT
The input strength unit.

Tekla.Structures.Catalogs.ProfileItemParameter.ParameterUnitTypeEnum.OUTPUT_STRESS_UNIT
The output stress unit.

Tekla.Structures.Catalogs.ProfileItemParameter.ParameterUnitTypeEnum.INPUT_MODULUS_UNIT
The input modulus unit.

Tekla.Structures.Catalogs.ProfileItemParameter.ParameterUnitTypeEnum.INPUT_DENSITY_UNIT
The input density unit.

Tekla.Structures.Catalogs.ProfileItemParameter.ParameterUnitTypeEnum.INPUT_MOMENT_UNIT
The input moment unit.

Tekla.Structures.Catalogs.ProfileItemParameter.ParameterUnitTypeEnum.OUTPUT_MOMENT_UNIT
The output moment unit.

Tekla.Structures.Catalogs.ProfileItemParameter.ParameterUnitTypeEnum.INPUT_DISTRIBMOMENT_UNIT
The input distributed moment unit.

Tekla.Structures.Catalogs.ProfileItemParameter.ParameterUnitTypeEnum.INPUT_ROTSPRINGCONST_UNIT
The input rotation spring constant unit.

Tekla.Structures.Catalogs.ProfileItemParameter.ParameterUnitTypeEnum.INPUT_TEMPERATURE_UNIT
The input temperature unit.

Tekla.Structures.Catalogs.ProfileItemParameter.ParameterUnitTypeEnum.OUTPUT_TEMPERATURE_UNIT
The output temperature unit.

Tekla.Structures.Catalogs.ProfileItemParameter.ParameterUnitTypeEnum.INPUT_THERMDILATCOEFF_UNIT
The input thermal dilatation coefficient unit.

Tekla.Structures.Catalogs.ProfileItemParameter.ParameterUnitTypeEnum.INPUT_FACTOR_UNIT
The input factor unit.

Tekla.Structures.Catalogs.ProfileItemParameter.ParameterUnitTypeEnum.INPUT_DATE_UNIT
The input date unit.

Tekla.Structures.Catalogs.ProfileItemParameter.ParameterUnitTypeEnum.INPUT_DATE_TIME_MIN_UNIT
The input date time minutes unit.

Tekla.Structures.Catalogs.ProfileItemParameter.ParameterUnitTypeEnum.INPUT_DATE_TIME_SEC_UNIT
The input date time seconds unit.

Tekla.Structures.Catalogs.ProfileItemParameter.ParameterUnitTypeEnum.INPUT_LENGTH_FRACTIONAL_IMPERIAL
The input length, fractional imperial.

Tekla.Structures.Catalogs.ProfileItemParameter.ParameterUnitTypeEnum.INPUT_DEFORMATION_FRACTIONAL_IMPERIAL
The input deformation, fractional imperial.

Tekla.Structures.Catalogs.ProfileItemParameter.ParameterUnitTypeEnum.INPUT_DIMENSION_FRACTIONAL_IMPERIAL
The input dimension, fractional imperial.

Tekla.Structures.Catalogs.ProfileItemParameter.ParameterUnitTypeEnum.INPUT_RADIUSOFINERTIA_FRACTIONAL_IMPERIAL
The radius of inertia, fractional imperial.

Tekla.Structures.Catalogs.ProfileItemParameter.ParameterUnitTypeEnum.OUTPUT_LENGTH_FRACTIONAL_IMPERIAL
The output length, fractional imperial.

Tekla.Structures.Catalogs.ProfileItemParameter.ParameterUnitTypeEnum.OUTPUT_DEFORMATION_FRACTIONAL_IMPERIAL
The output deformation, fractional imperial.